---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ReferencePlanesOverconstrained
source: html/9f9a4517-a2a1-2a41-8a23-dcb7c4469b07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ReferencePlanesOverconstrained Property

Reference Planes are overconstrained.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReferencePlanesOverconstrained { get; }
```